In [1]:
import pandas as pd
import sqlite3

setup! dont run this again after the first run

In [184]:
#loading data; it is huge so this needs separate cell
dfog = pd.read_csv(r"C:\Users\Norah\Downloads\dataset_2025-12-01T17_13_53.256433917Z_DEFAULT_INTEGRATION_IMF.STA_BOP_21.0.0.csv")

C:\Users\Norah\AppData\Local\Temp\ipykernel_9700\3694255994.py:2: DtypeWarning: Columns (5,8,20,22,24,42,44) have mixed types. Specify dtype option on import or set low_memory=False.
  dfog = pd.read_csv(r"C:\Users\Norah\Downloads\dataset_2025-12-01T17_13_53.256433917Z_DEFAULT_INTEGRATION_IMF.STA_BOP_21.0.0.csv")

In [202]:
dfog

,COUNTRY,BOP_ACCOUNTING_ENTRY,INDICATOR,TIME_PERIOD,OBS_VALUE
60,Denmark,Debit/Expenditure,All modes of transport; freight,1975,368.345474
61,Denmark,Debit/Expenditure,All modes of transport; freight,1976,408.169286
62,Denmark,Debit/Expenditure,All modes of transport; freight,1977,455.790084
63,Denmark,Debit/Expenditure,All modes of transport; freight,1978,553.288712
64,Denmark,Debit/Expenditure,All modes of transport; freight,1981,834.962546
...,...,...,...,...,...
12016789,Somalia,"Liabilities, Net incurrence of liabilities",Direct investor in direct invesment enterprise...,NaN,NaN
12016907,Yemen Arab Republic,Net (net acquisition of financial assets less ...,"Other investment, Loans, Adjusted using IMF ac...",NaN,NaN
12016933,"Yemen, People's Democratic Republic of",Net (net acquisition of financial assets less ...,"Other investment, Loans, Adjusted using IMF ac...",NaN,NaN
12016953,Rwanda,Liabilities,"Other investment, Debt instruments other than ...",NaN,NaN
12017050,Turkmenistan,Net (net acquisition of financial assets less ...,"Other investment, Loans, Adjusted using IMF ac...",NaN,NaN

In [203]:
country = pd.read_excel("IMFCode.xlsx",sheet_name="Country")
indicators = pd.read_excel("IMFCode.xlsx",sheet_name="Indicators c-divided by service")

In [187]:
dfog = dfog[dfog["FREQUENCY"] == "Annual"]
dfog = dfog[dfog["UNIT"] == "US dollar"]
dfog = dfog.iloc[:, 0:7]
dfog = dfog.drop(columns=["FREQUENCY","UNIT"])
dfog

,COUNTRY,BOP_ACCOUNTING_ENTRY,INDICATOR,TIME_PERIOD,OBS_VALUE
60,Denmark,Debit/Expenditure,All modes of transport; freight,1975,368.345474
61,Denmark,Debit/Expenditure,All modes of transport; freight,1976,408.169286
62,Denmark,Debit/Expenditure,All modes of transport; freight,1977,455.790084
63,Denmark,Debit/Expenditure,All modes of transport; freight,1978,553.288712
64,Denmark,Debit/Expenditure,All modes of transport; freight,1981,834.962546
...,...,...,...,...,...
12016789,Somalia,"Liabilities, Net incurrence of liabilities",Direct investor in direct invesment enterprise...,NaN,NaN
12016907,Yemen Arab Republic,Net (net acquisition of financial assets less ...,"Other investment, Loans, Adjusted using IMF ac...",NaN,NaN
12016933,"Yemen, People's Democratic Republic of",Net (net acquisition of financial assets less ...,"Other investment, Loans, Adjusted using IMF ac...",NaN,NaN
12016953,Rwanda,Liabilities,"Other investment, Debt instruments other than ...",NaN,NaN
12017050,Turkmenistan,Net (net acquisition of financial assets less ...,"Other investment, Loans, Adjusted using IMF ac...",NaN,NaN

Credit/Revenue Tables

In [204]:
df = dfog[dfog["BOP_ACCOUNTING_ENTRY"] == "Credit/Revenue"]
df = df.drop(columns=["BOP_ACCOUNTING_ENTRY"])
df

,COUNTRY,INDICATOR,TIME_PERIOD,OBS_VALUE
150,Denmark,"Social benefits, Financial corporations, nonfi...",2005,53.928718
151,Denmark,"Social benefits, Financial corporations, nonfi...",2006,64.292377
152,Denmark,"Social benefits, Financial corporations, nonfi...",2007,80.250877
153,Denmark,"Social benefits, Financial corporations, nonfi...",2008,120.178930
154,Denmark,"Social benefits, Financial corporations, nonfi...",2009,154.749760
...,...,...,...,...
12015711,New Zealand,"Other investment, Investment income, interest ...",NaN,NaN
12016061,Czechoslovakia,"Other investment, Investment income, interest ...",NaN,NaN
12016483,Yemen Arab Republic,"Other investment, Investment income, interest ...",NaN,NaN
12016509,"Yemen, People's Democratic Republic of","Other investment, Investment income, interest ...",NaN,NaN
12016768,"Yugoslavia, Socialist Federal Republic of","Other investment, Investment income, interest ...",NaN,NaN

In [205]:
services = dfog[dfog['INDICATOR'] == "Services"].copy()
services = services[services["BOP_ACCOUNTING_ENTRY"] == "Credit/Revenue"]
services = services.drop(columns=["BOP_ACCOUNTING_ENTRY"])
services = services.rename(columns={'OBS_VALUE': 'SERVICE_VALUE'})


conn = sqlite3.connect(r"C:\IFs\RUNFILES\IFsDataImport - Copy (10).db")
cursor = conn.cursor()

for _, row in indicators.iterrows():
    indicator_id = row['Indicator']
    table_name = row['Variable']
    sql_table_name = f"Series{table_name}"

    ind_df = df[df['INDICATOR'] == indicator_id].copy()

    merged = ind_df.merge(
        services[['COUNTRY', 'TIME_PERIOD', 'SERVICE_VALUE']],
        on=['COUNTRY', 'TIME_PERIOD'],
        how='left'
    )

    merged['RESULT'] = (merged['OBS_VALUE'] / merged['SERVICE_VALUE'] * 100).round(3)
    merged = merged.dropna(subset=['TIME_PERIOD'])
    merged['TIME_PERIOD'] = merged['TIME_PERIOD'].astype(str).str.strip()
    
    final = merged[['COUNTRY', 'TIME_PERIOD', 'RESULT']]
    
    final = merged[['COUNTRY', 'TIME_PERIOD', 'RESULT']].pivot_table(
        index='COUNTRY',
        columns='TIME_PERIOD',
        values='RESULT'
    ).reset_index()   
     
    final = country.merge(final, on='COUNTRY', how='left')
    final = final.drop(columns=['COUNTRY'])
    final.columns = [str(c) for c in final.columns]

    year_columns = [col for col in final.columns if str(col).isdigit()]
    final['Earliest'] = final[year_columns].bfill(axis=1).iloc[:, 0]
    final['MostRecent'] = final[year_columns].ffill(axis=1).iloc[:, -1]
    final[year_columns + ['Earliest', 'MostRecent']] = final[year_columns + ['Earliest', 'MostRecent']].round(3)

    columns_sql = ['Country VARCHAR(255)', 'FIPS_CODE VARCHAR(255)']
    columns_sql += [f'"{col}" DOUBLE(53)' for col in year_columns + ['Earliest', 'MostRecent']]
    create_table_sql = f"CREATE TABLE '{sql_table_name}' ({', '.join(columns_sql)})"
    cursor.execute(f'DROP TABLE IF EXISTS "{sql_table_name}"')
    cursor.execute(create_table_sql)

    final.to_sql(sql_table_name, conn, if_exists='append', index=False)
    print(f"Imported: {sql_table_name}")

conn.commit()
conn.close()

Imported: SeriesExOtherConstruction%Ser
Imported: SeriesExOtherBusiness%Ser
Imported: SeriesExMaintRepair%Ser
Imported: SeriesExManuSer%Ser
Imported: SeriesExOtherCulRecreation%Ser
Imported: SeriesExOtherFinancial%Ser
Imported: SeriesExOtherGovGoodSer%Ser
Imported: SeriesExOtherInsurPen%Ser
Imported: SeriesExOtherIntellectual%Ser
Imported: SeriesExOtherTelCom%Ser
Imported: SeriesExOtherFinancial%Ser
Imported: SeriesExTransportFreight%Ser
Imported: SeriesExTransportOther%Ser
Imported: SeriesExTransportPass%Ser
Imported: SeriesExTravelBusiness%Ser
Imported: SeriesExTravelPersonal%Ser

Debit/Expenditure

In [206]:
df1 = dfog[dfog["BOP_ACCOUNTING_ENTRY"] == "Debit/Expenditure"]
df1 = df1.drop(columns=["BOP_ACCOUNTING_ENTRY"])
df1
indicators = pd.read_excel("IMFCode.xlsx",sheet_name="Indicators d-divided by service")
df1

,COUNTRY,INDICATOR,TIME_PERIOD,OBS_VALUE
60,Denmark,All modes of transport; freight,1975,368.345474
61,Denmark,All modes of transport; freight,1976,408.169286
62,Denmark,All modes of transport; freight,1977,455.790084
63,Denmark,All modes of transport; freight,1978,553.288712
64,Denmark,All modes of transport; freight,1981,834.962546
...,...,...,...,...
12013161,Yemen Arab Republic,"Other investment, Investment income, interest ...",NaN,NaN
12013268,"Yugoslavia, Socialist Federal Republic of","Other investment, Investment income, interest ...",NaN,NaN
12014062,Belgium-Luxembourg,"Other investment, Investment income, interest ...",NaN,NaN
12014112,Somalia,"Other investment, Investment income, interest ...",NaN,NaN
12015759,Belgium-Luxembourg,"Portfolio investment, Total financial assets/l...",NaN,NaN

In [207]:
services = dfog[dfog['INDICATOR'] == "Services"].copy()
services = services[services["BOP_ACCOUNTING_ENTRY"] == "Debit/Expenditure"]
services = services.drop(columns=["BOP_ACCOUNTING_ENTRY"])
services = services.rename(columns={'OBS_VALUE': 'SERVICE_VALUE'})


conn = sqlite3.connect(r"C:\IFs\RUNFILES\IFsDataImport - Copy (10).db")
cursor = conn.cursor()

for _, row in indicators.iterrows():
    indicator_id = row['Indicator']
    table_name = row['Variable']
    sql_table_name = f"Series{table_name}"

    ind_df = df1[df1['INDICATOR'] == indicator_id].copy()

    merged = ind_df.merge(
        services[['COUNTRY', 'TIME_PERIOD', 'SERVICE_VALUE']],
        on=['COUNTRY', 'TIME_PERIOD'],
        how='left'
    )

    merged['RESULT'] = (merged['OBS_VALUE'] / merged['SERVICE_VALUE'] * 100).round(3)
    merged = merged.dropna(subset=['TIME_PERIOD'])
    merged['TIME_PERIOD'] = merged['TIME_PERIOD'].astype(str).str.strip()
    
    final = merged[['COUNTRY', 'TIME_PERIOD', 'RESULT']]
    
    final = merged[['COUNTRY', 'TIME_PERIOD', 'RESULT']].pivot_table(
        index='COUNTRY',
        columns='TIME_PERIOD',
        values='RESULT'
    ).reset_index()   
     
    final = country.merge(final, on='COUNTRY', how='left')
    final = final.drop(columns=['COUNTRY'])
    final.columns = [str(c) for c in final.columns]

    year_columns = [col for col in final.columns if str(col).isdigit()]
    final['Earliest'] = final[year_columns].bfill(axis=1).iloc[:, 0]
    final['MostRecent'] = final[year_columns].ffill(axis=1).iloc[:, -1]
    final[year_columns + ['Earliest', 'MostRecent']] = final[year_columns + ['Earliest', 'MostRecent']].round(3)

    columns_sql = ['Country VARCHAR(255)', 'FIPS_CODE VARCHAR(255)']
    columns_sql += [f'"{col}" DOUBLE(53)' for col in year_columns + ['Earliest', 'MostRecent']]
    create_table_sql = f"CREATE TABLE '{sql_table_name}' ({', '.join(columns_sql)})"
    cursor.execute(f'DROP TABLE IF EXISTS "{sql_table_name}"')
    cursor.execute(create_table_sql)

    final.to_sql(sql_table_name, conn, if_exists='append', index=False)
    print(f"Imported: {sql_table_name}")

conn.commit()
conn.close()

Imported: SeriesImOtherInsurPen%Ser
Imported: SeriesImOtherIntellectual%Ser
Imported: SeriesImOtherTelCom%Ser
Imported: SeriesImTransportFreight%Ser
Imported: SeriesImTransportOther%Ser
Imported: SeriesImTransportPass%Ser
Imported: SeriesImTravelBusiness%Ser
Imported: SeriesImTravelPersonal%Ser
Imported: SeriesImMaintRepair%Ser
Imported: SeriesImManuSer%Ser
Imported: SeriesImOtherBusiness%Ser
Imported: SeriesImOtherConstruction%Ser
Imported: SeriesImOtherCulRecreation%Ser
Imported: SeriesImOtherFinancial%Ser
Imported: SeriesImOtherGovGoodSer%Ser